'use strict';

/*
Необходимо создать объект, в котором будут объединены два массива en и ru 
так, чтобы в объекте ключами выступали значения из массива en, а значениями 
объекта являлись значения из массива ru.
*/

console.log('*** task 05');
{
  const en = ['mon', 'tue', 'wed', 'thu', 'fri', 'sat', 'sun'];
  const ru = [
    'понедельник',
    'вторник',
    'среда',
    'четверг',
    'пятница',
    'суббота',
    'воскресенье',
  ];

  const translate = {};
  for (let i = 0; i < en.length; i++) {
    translate[en[i]] = ru[i];
  }

  console.log(translate);
}
